---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MultiReferenceAnnotationFailures.MultiReferenceAnnotationReferenceCategoryForcesDeletion
source: html/faa330d2-c7a5-4878-044e-5162f9bd45cd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MultiReferenceAnnotationFailures.MultiReferenceAnnotationReferenceCategoryForcesDeletion Property

Changing the reference category will cause instances of this annotation type to be deleted, because they no longer match their references.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultiReferenceAnnotationReferenceCategoryForcesDeletion { get; }
```